In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
data = [1,3,5,7,9]
data

[1, 3, 5, 7, 9]

In [3]:
pd.DataFrame(data, columns=["col1"])

   col1
0     1
1     3
2     5
3     7
4     9

In [4]:
pd.Series(data)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [5]:
data2 = np.arange(1,24,2).reshape(3,4)
data2

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [6]:
pd.DataFrame(data2, columns=["col1", "col2", "col3", "col4"])

   col1  col2  col3  col4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [7]:
df = pd.DataFrame(data2, columns=["col1", "col2", "col3", "col4"], index=["a","b","c"])
df

   col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(data2)

numpy.ndarray

In [10]:
df.size

12

In [11]:
df.shape

(3, 4)

In [12]:
df.ndim

2

In [13]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [14]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [15]:
df.values

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [16]:
len(df)

3

In [17]:
df.keys()

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [18]:
df.col1

a     1
b     9
c    17
Name: col1, dtype: int32

In [19]:
df

   col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [20]:
s1 = np.random.randint(2,10, size = 40)
s2 = np.random.randint(30,100, size = 40)
s3 = np.random.randint(100,150, size = 40)

In [21]:
myDict = {'var1':s1,'var2':s2,'var3':s3}
myDict

{'var1': array([7, 7, 3, 9, 7, 2, 6, 3, 8, 5, 6, 4, 7, 5, 2, 6, 2, 2, 8, 9, 5, 7,
        2, 9, 5, 4, 2, 7, 4, 9, 6, 5, 5, 4, 7, 3, 8, 5, 9, 9]),
 'var2': array([33, 94, 51, 69, 62, 55, 64, 74, 96, 64, 65, 32, 74, 97, 49, 73, 85,
        48, 49, 82, 81, 43, 52, 75, 82, 97, 60, 97, 98, 83, 79, 43, 39, 91,
        91, 73, 98, 33, 36, 70]),
 'var3': array([114, 106, 100, 112, 120, 122, 123, 100, 142, 129, 134, 123, 132,
        122, 112, 122, 115, 119, 113, 142, 123, 107, 149, 132, 135, 107,
        126, 113, 144, 125, 141, 119, 104, 110, 101, 104, 103, 126, 111,
        146])}

In [22]:
df_dict = pd.DataFrame(myDict)
df_dict

    var1  var2  var3
0      7    33   114
1      7    94   106
2      3    51   100
3      9    69   112
4      7    62   120
5      2    55   122
6      6    64   123
7      3    74   100
8      8    96   142
9      5    64   129
10     6    65   134
11     4    32   123
12     7    74   132
13     5    97   122
14     2    49   112
15     6    73   122
16     2    85   115
17     2    48   119
18     8    49   113
19     9    82   142
20     5    81   123
21     7    43   107
22     2    52   149
23     9    75   132
24     5    82   135
25     4    97   107
26     2    60   126
27     7    97   113
28     4    98   144
29     9    83   125
30     6    79   141
31     5    43   119
32     5    39   104
33     4    91   110
34     7    91   101
35     3    73   104
36     8    98   103
37     5    33   126
38     9    36   111
39     9    70   146

In [23]:
df_dict[3:5]

   var1  var2  var3
3     9    69   112
4     7    62   120

In [24]:
df_dict2 = df_dict[3:5]
df_dict2

   var1  var2  var3
3     9    69   112
4     7    62   120

In [25]:
df_dict2.index = ["a","b"]
df_dict2

   var1  var2  var3
a     9    69   112
b     7    62   120

In [66]:
df_dict2.columns = ["X","Y","Z"]
df_dict2

   X   Y    Z
a  2  77  113
b  9  84  147

In [67]:
pd.DataFrame(df_dict2.values, index = ["c","d"], columns= ["t","r","s"])

   t   r    s
c  2  77  113
d  9  84  147

In [68]:
np.random.seed(101)
df3 = pd.DataFrame(  np.random.randn(5,4),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [70]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [71]:
df3[["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [72]:
df3.loc[:,"W":"Y"]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [73]:
df3.loc["B":"D", "W":"Y"]

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237

In [74]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df3["X"]

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [78]:
df3["Y"]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [83]:
df3["Z"]

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [90]:
df3["Result"]=df3["W"]*df3["X"] + df3["Y"]**2 - df3["Z"]
df3

ModuleNotFoundError: No module named 'pandas.core.computation.expressions'

In [91]:
df3.mean()

W    0.343858
X    0.453764
Y    0.452287
Z    0.431871
dtype: float64